books/Running lean.html
---
layout: notes
---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Advice</a></li>
<li><a href="#sec-2">2. Team</a></li>
<li><a href="#sec-3">3. What you will learn</a></li>
<li><a href="#sec-4">4. Startups</a></li>
<li><a href="#sec-5">5. Customers</a></li>
<li><a href="#sec-6">6. Lean</a></li>
<li><a href="#sec-7">7. Lean canvas</a></li>
<li><a href="#sec-8">8. Questions</a></li>
<li><a href="#sec-9">9. Tools</a></li>
<li><a href="#sec-10">10. Interesting figures</a></li>
</ul>
</div>
</nav>

<p>
Running Lean: Iterate from Plan A to a Plan That Works (Lean Series)
— Ash Maurya
<a href="http://theleanstartup.com">http://theleanstartup.com</a>.
</p>

<p>
Another authoritative guide:
Eric Ries — The Lean Startup
</p>

<p>
Amazing Marketing Book:
Al Ries and Jack Trout — Positioning: The Battle for Your Mind
</p>

<p>
Software pricing:
Neil Davidson — Don’t Just Roll the Dice.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Advice</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Practice Trumps Theory
</li>
<li>You get a gold star not for following a process, but for achieving results.
</li>
<li>When the time comes, it is important to get competent professional advice about financing and structuring your company and its intellectual property assets.
</li>
<li>Your job isn’t just building the best solution, but owning the entire business model and making all the pieces fit.
</li>
<li>The bigger risk for most startups is building something nobody wants.
</li>
<li>Be different, but make sure your difference matters.
</li>
<li>Think in the present. Business plans try too hard to predict the
future, which is impossible.
</li>
<li>Be concise. It’s a lot easier to describe something in a paragraph than in a single sentence.
</li>
<li>Instant Clarity Headline = End Result Customer Wants + Specific Period of Time + Address the Objections
</li>
<li>Study other good UVPs.
The best way to craft a good UVP is to study the UVPs of the
brands you admire. Visit their landing pages and deconstruct how
and why their messaging works. Some of my best teachers have been
Apple, 37signals, and FreshBooks.
</li>
<li>The initial goal of a startup is to learn, not to scale.
So, at first it’s OK to rely on any channels that get you in front
of potential customers. A commonly cited paid channel is search
engine marketing (SEM) (hard to do today because of cost increases).
</li>
<li>You need to have a product worth spreading first.
</li>
<li>Focus on finished story benefits.
</li>
<li>Pivots are about finding a plan that works, while optimizations are about accelerating that plan.
</li>
<li>“Life is too short to keep building something nobody (or not enough people) want.”
</li>
<li>It is imperative that you share your model with at least one other person.
</li>
<li>It’s not what you measure, but how.
</li>
<li>Make Feedback Easy
</li>
<li>Catch and report unexpected errors. When early users run into problems, they don’t turn into testers. They leave.
</li>
<li>Reach out to your users. You should be able to extract the list of users that failed at a particular step in your funnel. If you know what went wrong, correct it, and ask those users to come back.
</li>
<li>Get “lost sales” prospects to talk to you.
Offer a $25–$50 gift card or donation to charity in exchange for
15 minutes of their time.
</li>
<li>Your goal is to establish “just enough” traffic to support learning.
</li>
<li>Features Must Be Pulled, Not Pushed.
</li>
<li>building enough of a runway so that I could afford my creative addiction was the prize here.
</li>
<li>Challenge yourself to find the simplest thing you can do to test a hypothesis.
</li>
<li>Give your MVP a chance. First troubleshoot and resolve issues with existing features before chasing new features.
</li>
<li>Backlog All potential features start life in the Backlog bucket. They get in there in one of the following ways: Existing feature improvements (e.g., refined signup flow) Customer feature requests Your feature requests (e.g., the nice-to-haves you deferred earlier)
</li>
<li>The burden of quickly identifying problems and reaching out to
your users is yours.
</li>
<li>What Are the Early Traction Exit Criteria?
You are done when you can: Retain 40% of your users and pass the Sean Ellis Test
</li>
<li>The key is not to take this feedback as either “judgment” or “validation,” but rather as a means of identifying and prioritizing risk.
</li>
<li>I specifically want to know: What do they consider to be the riskiest aspect of this plan? Have they overcome similar risks? How? How would they go about testing these risks? Are there other people I should speak with?
</li>
<li>Validating hypotheses in this way — first qualitatively, then quantitatively — is a key principle we’ll see applied in various stages throughout this book.
</li>
<li>Getting the product right First make sure you have a problem worth solving. Then define the smallest possible solution (MVP). Build and validate your MVP at small scale (demonstrate UVP). Then verify it at large scale.
</li>
<li>Product/Market fit means being in a good market with a product that can satisfy that market.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Team</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Organize around two teams, the Problem team and the Solution team.
</li>
<li>team The Problem team is mostly involved with “outside-the-building” activities such as interviewing customers, running usability tests, and so on. The Solution team The Solution team is mostly involved with “inside-the-building” activities such as writing code, running tests, deploying releases, and so on. I say “mostly” because these teams need to be highly cross-functional with overlapping members.
</li>
<li>At this stage of a product, you’re best served with having a single Problem/Solution team. Start with the Smallest Team Possible, but No Smaller The ideal Problem/Solution team size is two or three people.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What you will learn</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>How to first find a problem worth solving before defining a solution
</li>
<li>How to find early customers
</li>
<li>When is the ideal time to raise funding
The ideal time to raise your big round of funding is after
product/market fit, because at that time, both you and your
investors have aligned goals: to scale the business.
</li>
<li>How to test pricing
</li>
<li>How to decide what goes into Release 1.0
</li>
<li>How to build and measure what customers want
</li>
<li>How to maximize for speed, learning, and focus
</li>
<li>What is product/market fit
</li>
<li>How to iterate to product/market fit
</li>
<li>Everyone gets hit by ideas when they least expect them (in the shower, while driving, etc.). Most people ignore them. Entrepreneurs choose to act on them.
</li>
<li>Customers don’t care about your solution. They care about their problems.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Startups</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Of those startups that succeed, two-thirds report having drastically changed their plans along the way.
</li>
<li>The second realization was that startups can consume years of your life.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Customers</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Even though customers hold all the answers, you simply cannot ask
them what they want.
</li>
<li>We started listening to the most popular (vocal) requests and ended up with a bloated application and lots of one-time-use features.
</li>
<li>Maximize learning (about customers) per unit time.
</li>
<li>In order to maximize learning, you have to pick bold outcomes
instead of chasing incremental improvements.
So, rather than changing the color of your call-to-action button,
change your entire landing page. Rather than tweaking your unique
value proposition (UVP) for a single customer segment, experiment
with different UVPs for different customer segments.
</li>
<li>Distinguish between customers and users.
If you have multiple user roles in your product, identify your
customers. A customer is someone who pays for your product. A user
does not.
</li>
<li>You need to start with a specific customer in mind.
</li>
<li>Target early adopters.
</li>
<li>Don’t ask customers what they want. Measure what they do.
</li>
<li>Prefer face-to-face interviews.
</li>
<li>Start with people you know.
</li>
<li>Prepare yourself to interview 30 to 60 people.
</li>
<li>With my latest product, USERcycle, I used only customer interviews, HTML, and Illustrator mock-ups to understand the problem, define the solution, and sign up 100 paying customers before I started building the MVP.
</li>
<li>Prioritize customer segments that you believe will need your product the most. The goal is to have one or more of your top three problems as must-haves for them. Ease of reach (Channels) Building a path to customers is one of the harder aspects of building a successful product. If you have an easier path to one segment of customers over others, take that into consideration. It doesn’t guarantee you’ll find a problem worth solving or a viable business model, but it will get you out of the building faster and speed up your learning. Price/gross margin (Revenue Streams/Cost Structure) What you can charge for your product is largely driven by the customer segment. Pick a customer segment that allows you to maximize on your margins. The more money you get to keep, the fewer customers you need to reach to break even. Market size (Customer Segments) Pick a customer segment that represents a big enough market given the goals for your business. Technical feasibility (Solution) Visit your Solution box to ensure that your planned solution not only is feasible, but also represents the minimum feature set to put in front of customers.
</li>
<li>The fastest way to learn is to talk to customers. Not releasing code, or collecting analytics, but talking to people.
</li>
<li>You can’t see the customer during a survey. Body language cues are as much an indicator of Problem/Solution Fit as the answers themselves.
</li>
<li>I prefer getting feedback from customers in person or over the phone than through other means like email, forums, or discussion boards.
</li>
<li>Get paying customers to talk to you. Get them on the phone, thank them for upgrading, and ask them: How they heard about you (if you don’t know) Why they bought from you What could be improved
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Lean</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>“Being Lean” is fundamentally about eliminating waste or being
efficient with resources,
</li>
<li>Three steps:
<ul class="org-ul">
<li>Document your Plan A.
</li>
<li>Identify the riskiest parts of your plan.
</li>
<li>Systematically test your plan.
</li>
</ul>
</li>
<li>The first step is writing down your initial vision and then
sharing it with at least one other person. Use a one-page business
model for that (Lean canvas) - Figure 1-1
</li>
<li>Your first goal should be to establish just enough of a runway to
allow you to start testing and validating your business model with
customers.
</li>
<li>USERcycle is a customer lifecycle management software.
It helps companies convert their users into passionate customers.
Passionate customers come back and use your product, tell others
about your product, and pay for your product (or get you paid).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Lean canvas</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="http://LeanCanvas.com">http://LeanCanvas.com</a>
</p>

<ul class="org-ul">
<li>Lean Canvas helps deconstruct your business model into nine distinct subparts that are then systematically tested, in order of highest to lowest risk.
</li>
<li>Lean Canvas is a business model validation tool.
It’s a companion tool to this book that helps you document your
business model, measure progress, and communicate learning with
your internal and external stakeholders.
</li>
<li>Sketch a Lean Canvas for each customer segment.
I recommend starting with the top two or three customer segments
you feel you understand the best or find most promising.
</li>
<li>Sketch a canvas in one sitting.
</li>
<li>It’s OK to leave sections blank.
</li>
<li>A real unfair advantage is something that cannot be easily copied or bought.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Questions</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Is it something customers want? (must-have) Will they pay for it? If not, who will? (viable) Can it be solved? (feasible)
</li>
<li>Have I built something people want?
</li>
<li>Scale Key question: How do I accelerate growth?
</li>
<li>What are you solving? (Problem)
</li>
<li>How do customers rank the top three problems?
</li>
<li>Who is the competition? (Existing Alternatives)
</li>
<li>How do customers solve these problems today?
</li>
<li>Who has the pain? (Customer Segments)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Tools</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>There are lots of third-party analytics products on the market.
I have cut my teeth on Google Analytics, KISSmetrics, and Mixpanel.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Interesting figures</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Figure 1-6. Build-Measure-Learn loop
</li>
<li>Figure 1-7. Iteration meta-pattern
</li>
<li>Figure 3-1. Lean Canvas
</li>
<li>Figure 5-3. Lessons learned
</li>
<li>Figure 14-2 captures the workflow we’ve followed throughout this book.
</li>
<li>Figure 3-7. Dave McClure’s Pirate Metrics
</li>
<li>Figure 13-4. Getting Things Done (GTD) style workflow for how to process new work requests
</li>
<li>Figure 13-5. Kanban board
</li>
<li>Figure 9-6. There are several basic elements that make up a successful landing page
<ul class="org-ul">
<li>Unique value proposition Put the latest refinement of your UVP here.
</li>
<li>Supporting visual Support your UVP with a visual aid that resonates strongly with your target audience. The actual medium may be an image, a screenshot, or a video depending on your specific audience.
</li>
<li>A clear call to action Every page needs to have a single, clear call to action. It should stand out and set a clear expectation as to what happens next.
</li>
<li>Invitation to learn more Some visitors may need more information before they’re convinced.
</li>
<li>Provide additional links to your tour page (if you have one), or
your 1-800 number.
</li>
<li>Social proof Social proof elements help to raise your
credibility and trust.
They are typically provided through customer testimonials and
“As Seen On” logos. The reason they are absent from the landing
page in Figure 9-6 is that you don’t have these yet and will get
them later from your early adopters.
</li>
</ul>
</li>
</ul>
</div>
</div>
